class AsciiArt
  def self.pikachu
    print <<-'EOS'
                                   ,;;i
　　　 　ヽ;;;,,,、　　　　　　　　,;;;;;;i
　　　 　　＼;;;;ﾞ-,,　　　　　／　 /
　　　 　　　 ＼　 "'"⌒ﾞ"´　 ィ
　　　 　 　 　 /　　　　　　　　ヽ
　　　 　　　　l_ ●　_,､_,　 ●_ ﾚ^^'i　　 ＿
　　　 　　　　ヽ)　　ヽノ　　（_/　　/"￣ 　 ￣7
　　　 　　,-''"　｀　　"''"　　´　　/　＿　　　 /
　　　 　　{＿,,,,,l　　　　　　　　 ｲ＿_ヽ ￣"''''
　　　　　　　 　ﾉ　　　　　 　 　 |
　　　　　 　　 （　　　　　　　　　l
　　　　　　　　入　＿,,,,,＿　　ノ
　　　　　　 　{__,,-''｀　　　 ヽ､､）
EOS
  end

  def self.pikachu2
    print <<-'EOS'
EOS
  end

  def self.kairyu
    print <<-'EOS'
    ﾘ
    　 　　　　　　　　　　　r'" 　　　　　　　　/iヽ
    　　　　　＝=､､ 　　　_{_ 　　　　　　　　/' ｌ　ｌk
    　 　 　 　　　　ﾞﾞ⌒y',-､｀ヽ 　 　　　　/' 　ｌ 　ｌｌ
    　 　 　 　　　　　ノ　ﾋ」}　　ヽ、 　 　/'　 /　　ｌｌ
    　 　 　 　 　 　{ ´ 　 　 　 　　＼_ノ' 　 / 　 　ｌｌ
    　 　　　　　　　冫､＿ノ _, -､ 　　ヽ‐､,/ 　 　〃
    　 　 　 　 　／ 　 　 ｀入｀i─＼ _　｀く 　 　〃
    　　　　　,／ 　 　　／ 　ヽl二フ´　/ 　｀ヽ〃
    　 　　,∠-‐´￣ヽム--､ノL／ 　,ｲ　　　/ﾊ
    　 　　　　　　　　　　/´ 　kｩｖvノ_ｌ　　　´　l.
    　 　 　 　 　 　 　 　lｽｭノ仁＿＿_レ'´　ヽ. k
    　　　　　　　　　, --─∠l＿_＿_,/ 　 　 　ヽヽ
    　 　 　 　 　 ／　　　/ 　|＿＿_/　　　　　　l　|
    　 　 　　／ 　　＿__{　　l＿_＿l 　 　 　 　 l　,!
    　 　　　/　　 ／ 　 　＼　＼__,,へ. 　 　 　/ /
    　 　 　/　,／ 　 　 　／ 　／＼_ノ ＼ 　　{'´
    .　　　〈__/ 　 　 　　(7ｽ__/ 　 　　￣　〉 　 ヽ
    　 　 　 　 　 　 　　　　　　　　　　　 ｀くX_ｊﾌ
EOS
  end

  def self.ruby
    print <<-'EOF'
 _____       _             _   _       _
|  __ \     | |           | \ | |     | |
| |__) |   _| |__  _   _  |  \| | ___ | |_ ___
|  _  / | | | '_ \| | | | | . ` |/ _ \| __/ _ \
| | \ \ |_| | |_) | |_| | | |\  | (_) | |_  __/
|_|  \_\__,_|_.__/ \__, | |_| \_|\___/ \__\___|
                    __/ |
                   |___/
EOF
  end
end
